### Ref. Datacamp

#### Goal: Find the best KPI and do A/B testing

Data files: 

1. 'customerData.csv' -- demographics data of the customers who registered for a particular meditation app. 

2. After the free trial period has ended, customers can purchase a subscription. This data is in the 'inappPurchases.csv' file.

In [9]:
import pandas as pd

In [34]:
customerData = pd.read_csv('./datasets/customerData.csv', header=1)

In [35]:
customerData.head()

   Unnamed: 0         uid              reg_date device gender country  age
0         NaN  54030035.0  2017-06-29T00:00:00Z    and      M     USA   19
1         NaN  72574201.0  2018-03-05T00:00:00Z    iOS      F     TUR   22
2         NaN  64187558.0  2016-02-07T00:00:00Z    iOS      M     USA   16
3         NaN  92513925.0  2017-05-25T00:00:00Z    and      M     BRA   41
4         NaN  99231338.0  2017-03-26T00:00:00Z    iOS      M     FRA   59

In [36]:
customerData.drop('Unnamed: 0', axis=1, inplace=True)

In [37]:
customerData.head()

          uid              reg_date device gender country  age
0  54030035.0  2017-06-29T00:00:00Z    and      M     USA   19
1  72574201.0  2018-03-05T00:00:00Z    iOS      F     TUR   22
2  64187558.0  2016-02-07T00:00:00Z    iOS      M     USA   16
3  92513925.0  2017-05-25T00:00:00Z    and      M     BRA   41
4  99231338.0  2017-03-26T00:00:00Z    iOS      M     FRA   59

In [19]:
customerData.dtypes

uid         float64
reg_date     object
device       object
gender       object
country      object
age           int64
dtype: object

In [14]:
inAppPurchases = pd.read_csv('./datasets/inappPurchases.csv')

In [15]:
inAppPurchases.head()

,Unnamed: 0,date,uid,sku,price,Unnamed: 5,Unnamed: 6
0,NaN,2017-07-10,41195147,sku_three_499,499,NaN,NaN
1,NaN,2017-07-15,41195147,sku_three_499,499,NaN,NaN
2,NaN,2017-11-12,41195147,sku_four_599,599,NaN,NaN
3,NaN,2017-09-26,91591874,sku_two_299,299,NaN,NaN
4,NaN,2017-12-01,91591874,sku_four_599,599,NaN,NaN

In [20]:
inAppPurchases.drop(['Unnamed: 0', 'Unnamed: 5', 'Unnamed: 6'], axis = 'columns', inplace=True)

In [21]:
inAppPurchases.head()

         date       uid            sku  price
0  2017-07-10  41195147  sku_three_499    499
1  2017-07-15  41195147  sku_three_499    499
2  2017-11-12  41195147   sku_four_599    599
3  2017-09-26  91591874    sku_two_299    299
4  2017-12-01  91591874   sku_four_599    599

In [22]:
inAppPurchases.dtypes

date     object
uid       int64
sku      object
price     int64
dtype: object

In [24]:
uidPurchasesjoined = inAppPurchases.merge(customerData, on = ['uid'], how='inner')

In [25]:
uidPurchasesjoined.head()

,date,uid,sku,price,reg_date,device,gender,country,age
0,2017-07-10,41195147,sku_three_499,499,2017-06-26T00:00:00Z,and,M,BRA,17
1,2017-07-15,41195147,sku_three_499,499,2017-06-26T00:00:00Z,and,M,BRA,17
2,2017-11-12,41195147,sku_four_599,599,2017-06-26T00:00:00Z,and,M,BRA,17
3,2017-09-26,91591874,sku_two_299,299,2017-01-05T00:00:00Z,and,M,TUR,17
4,2017-12-01,91591874,sku_four_599,599,2017-01-05T00:00:00Z,and,M,TUR,17

In [26]:
uidPurchasesjoined.shape

(9006, 9)

In [38]:
customerData.head()

          uid              reg_date device gender country  age
0  54030035.0  2017-06-29T00:00:00Z    and      M     USA   19
1  72574201.0  2018-03-05T00:00:00Z    iOS      F     TUR   22
2  64187558.0  2016-02-07T00:00:00Z    iOS      M     USA   16
3  92513925.0  2017-05-25T00:00:00Z    and      M     BRA   41
4  99231338.0  2017-03-26T00:00:00Z    iOS      M     FRA   59

In [39]:
customerData['reg_date_formatted'] = customerData['reg_date'].apply(lambda x: x[:10])

In [40]:
customerData.head()

,uid,reg_date,device,gender,country,age,reg_date_formatted
0,54030035.0,2017-06-29T00:00:00Z,and,M,USA,19,2017-06-29
1,72574201.0,2018-03-05T00:00:00Z,iOS,F,TUR,22,2018-03-05
2,64187558.0,2016-02-07T00:00:00Z,iOS,M,USA,16,2016-02-07
3,92513925.0,2017-05-25T00:00:00Z,and,M,BRA,41,2017-05-25
4,99231338.0,2017-03-26T00:00:00Z,iOS,M,FRA,59,2017-03-26

In [41]:
uidPurchasesSameDayjoined = inAppPurchases.merge(customerData, left_on=['uid', 'date'], \
                                                right_on=['uid', 'reg_date_formatted'], how='inner')

In [42]:
uidPurchasesSameDayjoined.head()

,date,uid,sku,price,reg_date,device,gender,country,age,reg_date_formatted
0,2016-03-30,94055095,sku_four_599,599,2016-03-30T00:00:00Z,iOS,F,BRA,16,2016-03-30
1,2015-10-28,69627745,sku_one_199,199,2015-10-28T00:00:00Z,and,F,BRA,18,2015-10-28
2,2017-02-02,11604973,sku_seven_1499,499,2017-02-02T00:00:00Z,and,F,USA,16,2017-02-02
3,2016-06-05,22495315,sku_four_599,599,2016-06-05T00:00:00Z,and,F,USA,19,2016-06-05
4,2018-02-17,51365662,sku_two_299,299,2018-02-17T00:00:00Z,iOS,M,TUR,16,2018-02-17

In [43]:
uidPurchasesSameDayjoined.shape

(35, 10)

** Datetime gymanstics **

In [44]:
uidPurchasesjoined.dtypes

date        object
uid         object
sku         object
price        int64
reg_date    object
device      object
gender      object
country     object
age          int64
dtype: object

In [45]:
uidPurchasesjoined['date'] = pd.to_datetime(uidPurchasesjoined['date'])

In [47]:
uidPurchasesjoined['reg_date'] = pd.to_datetime(uidPurchasesjoined['reg_date'])

In [48]:
uidPurchasesjoined.dtypes

date        datetime64[ns]
uid                 object
sku                 object
price                int64
reg_date    datetime64[ns]
device              object
gender              object
country             object
age                  int64
dtype: object

In [52]:
uidPurchasesjoined['subscription_time'] = uidPurchasesjoined['date'] - uidPurchasesjoined['reg_date']

In [53]:
uidPurchasesjoined.head()

,date,uid,sku,price,reg_date,device,gender,country,age,subscription_time
0,2017-07-10,41195147,sku_three_499,499,2017-06-26,and,M,BRA,17,14 days
1,2017-07-15,41195147,sku_three_499,499,2017-06-26,and,M,BRA,17,19 days
2,2017-11-12,41195147,sku_four_599,599,2017-06-26,and,M,BRA,17,139 days
3,2017-09-26,91591874,sku_two_299,299,2017-01-05,and,M,TUR,17,264 days
4,2017-12-01,91591874,sku_four_599,599,2017-01-05,and,M,TUR,17,330 days

In [54]:
uidPurchasesjoined['subscription_time_days'] = uidPurchasesjoined['subscription_time'].dt.days

In [55]:
uidPurchasesjoined.head()

,date,uid,sku,price,reg_date,device,gender,country,age,subscription_time,subscription_time_days
0,2017-07-10,41195147,sku_three_499,499,2017-06-26,and,M,BRA,17,14 days,14
1,2017-07-15,41195147,sku_three_499,499,2017-06-26,and,M,BRA,17,19 days,19
2,2017-11-12,41195147,sku_four_599,599,2017-06-26,and,M,BRA,17,139 days,139
3,2017-09-26,91591874,sku_two_299,299,2017-01-05,and,M,TUR,17,264 days,264
4,2017-12-01,91591874,sku_four_599,599,2017-01-05,and,M,TUR,17,330 days,330

In [56]:
uidJoinedLessThan7days = uidPurchasesjoined[uidPurchasesjoined.subscription_time_days < 7]

In [57]:
uidJoinedLessThan7days.shape

(197, 11)

In [58]:
len(uidJoinedLessThan7days)

197

In [59]:
len(uidPurchasesjoined)

9006

In [60]:
customerData.head()

,uid,reg_date,device,gender,country,age,reg_date_formatted
0,54030035.0,2017-06-29T00:00:00Z,and,M,USA,19,2017-06-29
1,72574201.0,2018-03-05T00:00:00Z,iOS,F,TUR,22,2018-03-05
2,64187558.0,2016-02-07T00:00:00Z,iOS,M,USA,16,2016-02-07
3,92513925.0,2017-05-25T00:00:00Z,and,M,BRA,41,2017-05-25
4,99231338.0,2017-03-26T00:00:00Z,iOS,M,FRA,59,2017-03-26

In [61]:
inAppPurchases.head()

         date       uid            sku  price
0  2017-07-10  41195147  sku_three_499    499
1  2017-07-15  41195147  sku_three_499    499
2  2017-11-12  41195147   sku_four_599    599
3  2017-09-26  91591874    sku_two_299    299
4  2017-12-01  91591874   sku_four_599    599

In [62]:
purchasePriceMean = inAppPurchases.price.mean()

In [63]:
purchasePriceMean

406.77259604707973

In [64]:
inAppPurchases.price.agg('mean')

406.77259604707973

In [65]:
purchasePriceSummary = inAppPurchases.price.agg(['mean', 'median'])

In [66]:
purchasePriceSummary

mean      406.772596
median    299.000000
Name: price, dtype: float64

In [67]:
uidPurchasesjoined.head()

,date,uid,sku,price,reg_date,device,gender,country,age,subscription_time,subscription_time_days
0,2017-07-10,41195147,sku_three_499,499,2017-06-26,and,M,BRA,17,14 days,14
1,2017-07-15,41195147,sku_three_499,499,2017-06-26,and,M,BRA,17,19 days,19
2,2017-11-12,41195147,sku_four_599,599,2017-06-26,and,M,BRA,17,139 days,139
3,2017-09-26,91591874,sku_two_299,299,2017-01-05,and,M,TUR,17,264 days,264
4,2017-12-01,91591874,sku_four_599,599,2017-01-05,and,M,TUR,17,330 days,330

In [68]:
uidPurchasesjoined.agg({'price': ['mean', 'median'], 'age': ['mean', 'median']})

             price        age
mean    406.772596  23.922274
median  299.000000  21.000000

** Grouping and aggregating **

In [106]:
uidPurchasesjoined.groupby(by = ['device', 'gender']).agg({'price': ['mean', 'median', 'std']})

                    price
                     mean median         std
device gender
and    F       400.747504    299  179.984378
       M       416.237308    499  195.001520
iOS    F       404.435330    299  181.524952
       M       405.272401    299  196.843197

#### Calculating KPI: 

As a example, we will look at the average amount paid per purchase within a user's first 28 days.

This KPI can provide a sense of the popularity of different in-app purchase price points to users within their first month.

In [83]:
from datetime import datetime, timedelta

In [95]:
currDate = pd.Timestamp(2018, 3, 17, 0, 0, 0)

In [96]:
currDate

Timestamp('2018-03-17 00:00:00')

Filter out all users who registered in less than 28 days from the currDate

In [99]:
uidPurchasesFiltered = uidPurchasesjoined[uidPurchasesjoined['reg_date'] < currDate - timedelta(days=28)]

In [101]:
uidPurchasesFiltered.head()

,date,uid,sku,price,reg_date,device,gender,country,age,subscription_time,subscription_time_days
0,2017-07-10,41195147,sku_three_499,499,2017-06-26,and,M,BRA,17,14 days,14
1,2017-07-15,41195147,sku_three_499,499,2017-06-26,and,M,BRA,17,19 days,19
2,2017-11-12,41195147,sku_four_599,599,2017-06-26,and,M,BRA,17,139 days,139
3,2017-09-26,91591874,sku_two_299,299,2017-01-05,and,M,TUR,17,264 days,264
4,2017-12-01,91591874,sku_four_599,599,2017-01-05,and,M,TUR,17,330 days,330

In [108]:
uidPurchasesjoined.shape

(9006, 11)

Filter to contain only purchases within the first 28 days of registration

In [115]:
uidPurchasesFiltered2 = uidPurchasesFiltered[(uidPurchasesFiltered['date'] <= uidPurchasesFiltered.reg_date + timedelta(days=28))]

In [116]:
uidPurchasesFiltered.shape

(8957, 11)

In [117]:
uidPurchasesFiltered2.shape

(590, 11)

In [118]:
uidPurchasesFiltered2.price.mean()

414.4237288135593

In [119]:
currDate

Timestamp('2018-03-17 00:00:00')

In [121]:
import numpy as np

In [122]:
month1 = np.where((uidPurchasesjoined.reg_date < currDate - timedelta(days=28)) & 
                  (uidPurchasesjoined.date < uidPurchasesjoined.reg_date + timedelta(days=28)), 
                  uidPurchasesjoined.price, np.nan)

In [123]:
uidPurchasesjoined['month1'] = month1

In [125]:
uidPurchasesjoined.head(10)

,date,uid,sku,price,reg_date,device,gender,country,age,subscription_time,subscription_time_days,month1
0,2017-07-10,41195147,sku_three_499,499,2017-06-26,and,M,BRA,17,14 days,14,499.0
1,2017-07-15,41195147,sku_three_499,499,2017-06-26,and,M,BRA,17,19 days,19,499.0
2,2017-11-12,41195147,sku_four_599,599,2017-06-26,and,M,BRA,17,139 days,139,NaN
3,2017-09-26,91591874,sku_two_299,299,2017-01-05,and,M,TUR,17,264 days,264,NaN
4,2017-12-01,91591874,sku_four_599,599,2017-01-05,and,M,TUR,17,330 days,330,NaN
5,2016-12-12,90783242,sku_two_299,299,2016-10-07,and,M,BRA,17,66 days,66,NaN
6,2017-06-12,90783242,sku_one_199,199,2016-10-07,and,M,BRA,17,248 days,248,NaN
7,2017-10-11,90783242,sku_five_899,899,2016-10-07,and,M,BRA,17,369 days,369,NaN
8,2017-10-27,90783242,sku_four_599,599,2016-10-07,and,M,BRA,17,385 days,385,NaN
9,2018-01-04,90783242,sku_one_199,199,2016-10-07,and,M,BRA,17,454 days,454,NaN

In [127]:
uidPurchasesjoined.groupby(by = ['device','gender'], as_index=False).agg({'month1': ['mean', 'median'], \
                                                                         'price': ['mean', 'median']})

  device gender      month1              price
                       mean median        mean median
0    and      F  388.204545  299.0  400.747504    299
1    and      M  413.705882  399.0  416.237308    499
2    iOS      F  432.587786  499.0  404.435330    299
3    iOS      M  433.313725  499.0  405.272401    299